[{"name":"Avatar", "rating":8.2, "users":138400, "length":162, "rel":2009, "des":"In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.", "watched":""},
 {"name":"The Avengers", "rating":8.9, "users":208122, "length":143, "rel":2012, "des":"When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!", "watched":""},
 {"name":"The Hobbit: The Desolation of Smaug", "rating":8.4, "users":333666, "length":161, "rel":2013, "des":"The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to get their gold back from the Dragon, Smaug.", "watched":""},
 {"name":"Captain America: Civil War", "rating":9.0, "users":12300, "length":147, "rel":2016, "des":"Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.", "watched":""},
 {"name":"Jurassic World", "rating":8.4, "users":450234, "length":124, "rel":2015, "des":"Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.", "watched":""},
 {"name":"Iron Man 3", "rating":7.5, "users":666666, "length":130, "rel":2013, "des":"When Tony Starks world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.", "watched":""},
 {"name":"Logan", "rating":10.0, "users":4, "length":137, "rel":2017, "des":"In the near future, a weary Logan cares for an ailing Professor X, somewhere on the Mexican border. However, Logans attempts to hide from the world, and his legacy, are upended when a young mutant arrives, pursued by dark forces.", "watched":""}]